Revit 2024 API
AppearanceAssetElement Class
 An element that contains a rendering asset used as a portion of a material definition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class AppearanceAssetElement : Element
Visual Basic
Public Class AppearanceAssetElement _
	Inherits Element
Visual C++
public ref class AppearanceAssetElement : public Element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.AppearanceAssetElement
See Also
AppearanceAssetElement Members
Autodesk.Revit.DB Namespace